# NullParameterValue Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NullParameterValue Properties
NullParameterValue Class See Also
---
The NullParameterValue type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ParameterValue.) |

# See Also
NullParameterValue Class
Autodesk.Revit.DB Namespace